{
  "generatedAt": "2026-02-01T04:35:27.091Z",
  "site": {
    "title": "J.A. Lamb",
    "description": "A minimal, readable publishing pipeline.",
    "url": "https://jlamb.dev"
  },
  "posts": [
    {
      "title": "Rolling my own static site generator",
      "date": "2026-02-01",
      "summary": "A small pipeline I can explain end to end.",
      "url": "https://jlamb.dev/posts/rolling-my-own-static-site-generator/",
      "path": "/posts/rolling-my-own-static-site-generator/",
      "slug": "rolling-my-own-static-site-generator",
      "content_html": "<p>I did not want a website product. I wanted a publishing pipeline I could understand in one sitting.</p>\n<p>The appeal was clarity: every step from Markdown to HTML is visible, and every file exists for a reason. There is no plugin marketplace to maintain, no theme layer to decode, and no magic I cannot explain later.</p>\n<p>Pipeline diagram:</p>\n<pre><code>src/posts/*.md\n  -&gt; frontmatter\n  -&gt; markdown -&gt; html\n  -&gt; layout wrap\n  -&gt; docs/posts/&lt;slug&gt;/index.html\n</code></pre>\n<p>Tradeoffs I am accepting:</p>\n<ul>\n<li>No plugin ecosystem</li>\n<li>No one-click themes</li>\n<li>No auto-generated tag pages unless I build them</li>\n<li>No CMS integration out of the box</li>\n</ul>\n<p>That is fine. The system exists to serve the writing, not the other way around.</p>\n<p>Owning the pipeline changes how I write. The code is infrastructure—boring and reliable—and the writing is the only thing that should feel alive.</p>\n",
      "content_text": "I did not want a website product. I wanted a publishing pipeline I could understand in one sitting. The appeal was clarity: every step from Markdown to HTML is visible, and every file exists for a reason. There is no plugin marketplace to maintain, no theme layer to decode, and no magic I cannot explain later. Pipeline diagram: src/posts/*.md -&gt; frontmatter -&gt; markdown -&gt; html -&gt; layout wrap -&gt; docs/posts/&lt;slug&gt;/index.html Tradeoffs I am accepting: No plugin ecosystem No one-click themes No auto-generated tag pages unless I build them No CMS integration out of the box That is fine. The system exists to serve the writing, not the other way around. Owning the pipeline changes how I write. The code is infrastructure—boring and reliable—and the writing is the only thing that should feel alive."
    },
    {
      "title": "Why static is still enough",
      "date": "2026-01-15",
      "summary": "The simplest pipeline is the one you can explain.",
      "url": "https://jlamb.dev/posts/why-static/",
      "path": "/posts/why-static/",
      "slug": "why-static",
      "content_html": "<p>Static sites are not a nostalgia act. They are a refusal to let the tool decide the shape of your thinking.</p>\n<p>When you can trace every step from a Markdown file to a deployed page, you can trust the system. That is the whole point.</p>\n",
      "content_text": "Static sites are not a nostalgia act. They are a refusal to let the tool decide the shape of your thinking. When you can trace every step from a Markdown file to a deployed page, you can trust the system. That is the whole point."
    }
  ]
}
